content/notes/creative-work-principles.md
---
title: "Principles for Creative Work"
author: ["Carl Colglazier"]
date: 2019-06-06
draft: false
---

A lot of these ideas aren't original. In fact, many are borrowed from
processes in software development and team management I have learned
while a college student. I am writing them down here as a bit of a
self-reminder. This note isn't perfect, but....


## Perfection is a fantasy {#perfection-is-a-fantasy}

Don't fall for it.

The idea of perfection comes the imagination: an unrealistic,
idealized version of ourselves with no basis in reality.  Most of the
time, "good enough" is good enough. The goal should never be
perfection.  Rather, ask what you are trying to convey? How do you
want people to feel? What do you want them to know? If you can say
you've put to form what you want the audience to experience, you have
succeeded.

Otherwise...


## Build quickly and fail cheaply. {#build-quickly-and-fail-cheaply-dot}

I wrote this up as one principle because I think they are necessarily
linked to each other.  As a recovering perfectionist, I remain
astutely aware of failure. It's inevitable in nearly any project. The
best way to manage it is to incorporate it into the process. Create
opportunities to flesh out ideas and prototypes to avoid racking up
higher costs later on.


## Reduce workflow friction. {#reduce-workflow-friction-dot}

How much time are you actually working and how much time do you spend
on paperwork? This isn't to say documentation is useless.
Coordination and teamwork often are exactly the bottlenecks which need
to be eliminated.


## It's easiest after you start. {#it-s-easiest-after-you-start-dot}

I did summer swim team for many years. In May and early June, getting
into the water was a real drudge. The air wasn't quite warm enough for
it to feel refreshing and the water hadn't warmed up enough from its
chilly tapwater origins. The thing is, you could spend forever building
everything up, waiting at the side of the pool. Trying to amp yourself
up. It gets you nowhere. The only way to get through it is to get started.
It sucks, but you get better at managing it.